import react from "react";
import "./About_us.css";

function About_us() {
  return (
    <react.Fragment>
      <div className="About_us">
        <p>
          ספורט פור יו הינה חנות האינטרנטית המובילה בארץ בייבוא אישי של חולצות
          הכדורגל של הקבוצות המובילות בעולם
          <br />
          אנו נותנים את השירות הטוב ביותר ומלווים את הלקוח עד קבלת המוצר אנו
          !ממליצים לכם לנסות ולהתרשם
          <br />
          אנו מספקים ללקוחות שלנו חולצות כדורגל וחליפות כדורגל באיכות גבוהה
          .ואביזרים נוספים במחירים הכי זולים
          <br />
          .ניתן לברר ולהזמין חולצות גם שלא מופיעות באתר פשוט צרו איתנו קשר
          <br />
          .הדפסות שם ומספר על גב החולצה ללא תשלום נוסף
          <br />
          ניתן גם ליצור חולצות בהתאמה אישית כולל לוגו אישי המודפס על חולצתכם
          .וכמובן שם ומספר על גב החולצה במחירים מעולים
          <br />
          !אנו מחכים להזמנותיכם ונשמח לעזור לתת לכם את השירות הטוב ביותר
          <br />
          :)גלישה מהנה
        </p>
      </div>
    </react.Fragment>
  );
}
export default About_us;
